{"author": ["Elastic"], "description": "Identifies the use of dsquery.exe for domain trust discovery purposes. Adversaries may use this command-line utility to enumerate trust relationships that may be used for Lateral Movement opportunities in Windows multi-domain forest environments.", "false_positives": ["Domain administrators may use this command-line utility for legitimate information gathering purposes."], "from": "now-9m", "index": ["winlogbeat-*", "logs-endpoint.events.*", "logs-windows.*", "endgame-*"], "language": "eql", "license": "Elastic License v2", "meta": {"original": {"creation_date": "2023/01/27", "id": "06a7a03c-c735-47a6-a313-51c354aef6c3", "integration": ["endpoint", "windows"], "maturity": "production", "min_stack_comments": "New fields added: required_fields, related_integrations, setup", "min_stack_version": "8.3.0", "updated_date": "2023/02/22"}}, "name": "Enumerating Domain Trusts via DSQUERY.EXE", "note": "", "query": "process where host.os.type == \"windows\" and event.type == \"start\" and\n    (process.name : \"dsquery.exe\" or process.pe.original_file_name: \"dsquery.exe\") and \n    process.args : \"*objectClass=trustedDomain*\"\n", "references": ["https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc732952(v=ws.11)", "https://posts.specterops.io/a-guide-to-attacking-domain-trusts-971e52cb2944"], "risk_score": 21, "rule_id": "27961f13-e41b-46b4-a8ab-88f9c1fd7ee9", "severity": "low", "tags": ["Elastic", "Host", "Windows", "Threat Detection", "Discovery", "Elastic Endgame"], "threat": [{"framework": "MITRE ATT&CK", "tactic": {"id": "TA0007", "name": "Discovery", "reference": "https://attack.mitre.org/tactics/TA0007/"}, "technique": [{"id": "T1482", "name": "Domain Trust Discovery", "reference": "https://attack.mitre.org/techniques/T1482/"}, {"id": "T1018", "name": "Remote System Discovery", "reference": "https://attack.mitre.org/techniques/T1018/"}]}], "timestamp_override": "event.ingested", "type": "eql"}
